---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.GeometryPositioning
source: html/00d7aa1d-bd28-e354-d4b5-c2078722af6e.htm
---
# Autodesk.Revit.DB.GroupTypeId.GeometryPositioning Property

Geometric Position.

## Syntax (C#)
```csharp
public static ForgeTypeId GeometryPositioning { get; }
```